In [1]:
import pandas as pd
import numpy as np

In [2]:
raw_csv_data = pd.read_csv("Index2018.csv")
df_comp= raw_csv_data.copy()

In [4]:
df_comp.date.describe()

count           6269
unique          6269
top       07/01/1994
freq               1
Name: date, dtype: object

In [6]:
 df_comp.date = pd.to_datetime(df_comp.date, dayfirst = True )

In [7]:
df_comp.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [8]:
df_comp.date.describe()

count                             6269
mean     2006-01-14 19:36:59.492742144
min                1994-01-07 00:00:00
25%                2000-01-11 00:00:00
50%                2006-01-12 00:00:00
75%                2012-01-19 00:00:00
max                2018-01-29 00:00:00
Name: date, dtype: object

In [9]:
df_comp.set_index("date", inplace= True )

In [10]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

In [11]:
df_comp.date.describe()

AttributeError: 'DataFrame' object has no attribute 'date'

In [13]:
df_comp = df_comp.asfreq('d')

In [14]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-08     NaN      NaN      NaN       NaN
1994-01-09     NaN      NaN      NaN       NaN
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25

In [15]:
df_comp.isna()

              spx    dax   ftse  nikkei
date
1994-01-07  False  False  False   False
1994-01-08   True   True   True    True
1994-01-09   True   True   True    True
1994-01-10  False  False  False   False
1994-01-11  False  False  False   False
...           ...    ...    ...     ...
2018-01-25  False  False  False   False
2018-01-26  False  False  False   False
2018-01-27   True   True   True    True
2018-01-28   True   True   True    True
2018-01-29  False  False  False   False

[8789 rows x 4 columns]

In [16]:
df_comp.isna().sum()

spx       2520
dax       2520
ftse      2520
nikkei    2520
dtype: int64

In [21]:
df_comp['spx'] = df_comp['spx'].ffill()

In [22]:
df_comp.isna().sum()

spx          0
dax       2520
ftse      2520
nikkei    2520
dtype: int64

In [25]:
df_comp['ftse'] = df_comp['ftse'].bfill()

In [26]:
df_comp.isna().sum()

spx          0
dax       2520
ftse         0
nikkei    2520
dtype: int64

In [28]:
df_comp['dax'] = df_comp['dax'].fillna(value = df_comp['dax'].mean())

In [29]:
df_comp.isna().sum()

spx          0
dax          0
ftse         0
nikkei    2520
dtype: int64

In [30]:
df_comp['market_value'] = df_comp.spx

In [31]:
df_comp.describe()

               spx           dax         ftse        nikkei  market_value
count  8789.000000   8789.000000  8789.000000   6269.000000   8789.000000
mean   1288.624342   6080.063363  5423.748617  14597.055700   1288.624342
std     488.039397   2326.164026  1146.098031   4043.122953    488.039397
min     438.920000   1911.700000  2876.600000   7054.980000    438.920000
25%     990.637242   4839.460000  4486.730000  10709.290000    990.637242
50%    1234.180000   6080.063363  5662.630000  15028.170000   1234.180000
75%    1460.250000   6739.300000  6304.250000  17860.470000   1460.250000
max    2872.867839  13559.600000  7778.637689  24124.150000   2872.867839

In [32]:
del df_comp['spx']

In [33]:
df_comp.describe()

                dax         ftse        nikkei  market_value
count   8789.000000  8789.000000   6269.000000   8789.000000
mean    6080.063363  5423.748617  14597.055700   1288.624342
std     2326.164026  1146.098031   4043.122953    488.039397
min     1911.700000  2876.600000   7054.980000    438.920000
25%     4839.460000  4486.730000  10709.290000    990.637242
50%     6080.063363  5662.630000  15028.170000   1234.180000
75%     6739.300000  6304.250000  17860.470000   1460.250000
max    13559.600000  7778.637689  24124.150000   2872.867839

In [35]:
del df_comp['dax']
del df_comp['ftse']
del df_comp['nikkei']

In [36]:
df_comp.describe()

       market_value
count   8789.000000
mean    1288.624342
std      488.039397
min      438.920000
25%      990.637242
50%     1234.180000
75%     1460.250000
max     2872.867839

In [37]:
size = int(len(df_comp)*0.8)

In [40]:
df = df_comp.iloc[:size]

In [42]:
df_test = df_comp.iloc[size:]

In [43]:
df.tail()

            market_value
date
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930
2013-04-06   1553.278930
2013-04-07   1553.278930

In [44]:
df_test.head()

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623